app/controllers/artworks_controller.rb

  def create
    @artwork = Artwork.new(artwork_params)

    respond_to do |format|
      if @artwork.save
---
INSERT INTO "artworks" ("paint", "title", "author", "date", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @artwork.destroy!
---
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 6]]

    def set_artwork
      @artwork = Artwork.find(params[:id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]